AmbiqAI/neuralSPOT/neuralspot/ns-core/src/apollo510b/gcc/startup_gcc.c
//******************************************************************************
//
// Place code immediately following vector table.
//
//******************************************************************************
//******************************************************************************
//
// The Patch table.
//
// The patch table should pad the vector table size to a total of 128 entries
// such that the code begins at 0x200.
// In other words, the final peripheral IRQ is always IRQ 111 (0-based).
//
//******************************************************************************
__attribute__ ((section(".patch")))
uint32_t const __Patchable[] =
{
                   0, 0, 0, 0, 0,           // 135-139
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 140-149
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 150-159
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 160-169
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 170-179
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 180-189
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 190-199
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 200-209
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 210-219
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0,           // 220-229
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0            // 230-239
};

// define the start of the patch table - at what would be vector 135
const uint32_t  * const __pPatchable =  (uint32_t *) __Patchable;

//*****************************************************************************
//
// The following are constructs created by the linker, indicating where the
// the "data" and "bss" segments reside in memory.  The initializers for the
// "data" segment resides immediately following the "text" segment.
//
//*****************************************************************************
extern uint32_t _etext;
extern uint32_t _sdata;
extern uint32_t _edata;
extern uint32_t _sbss;
extern uint32_t _ebss;

//*****************************************************************************
//
// This is the code that gets called when the processor first starts execution
// following a reset event.  Only the absolutely necessary set is performed,
// after which the application supplied entry() routine is called.
//
//*****************************************************************************
#if defined(__GNUC_STDC_INLINE__)

// Stub out some CPP init-related functions
extern void _init(void) { ; }
extern void _fini(void) { ; }
void *__dso_handle = 0;
extern void __libc_init_array(void);

void
Reset_Handler(void)
{
    //
    // Set the vector table pointer.
    //
    __asm("    ldr    r0, =0xE000ED08\n"
          "    ldr    r1, =__Vectors\n"
          "    str    r1, [r0]");

    //
    // Set the stack pointer.
    //
    __asm("    ldr    sp, [r1]");
#ifndef NOFPU
    //
    // Enable the FPU.
    //
    __asm("ldr  r0, =0xE000ED88\n"
          "ldr  r1,[r0]\n"
          "orr  r1,#(0xF << 20)\n"
          "str  r1,[r0]\n"
          "dsb\n"
          "isb\n");
#endif

    //
    // Set the stack limits
    //
    __set_MSPLIM(AM_STACK_LIMIT);
    __set_PSPLIM(AM_STACK_LIMIT);

    //
    // Copy the data segment initializers from flash to SRAM.
    //
    __asm("    ldr     r0, =_init_data\n"
          "    ldr     r1, =_sdata\n"
          "    ldr     r2, =_edata\n"
          "copy_loop:\n"
          "        ldr   r3, [r0], #4\n"
          "        str   r3, [r1], #4\n"
          "        cmp     r1, r2\n"
          "        blt     copy_loop\n");

    __asm("    ldr     r0, =_init_data_sram\n"
          "    ldr     r1, =_ssdata\n"
          "    ldr     r2, =_sedata\n"
          "copy_loop_sram:\n"
          "        ldr   r3, [r0], #4\n"
          "        str   r3, [r1], #4\n"
          "        cmp     r1, r2\n"
          "        blt     copy_loop_sram\n");

    //
    // Copy the ITCM text from flash to ITCM.
    //
    __asm("    ldr     r0, =_init_itcm_text\n"
          "    ldr     r1, =_s_itcm_text\n"
          "    ldr     r2, =_e_itcm_text\n"
          "copy_loop_itcm:\n"
          "    ldr     r3, [r0], #4\n"
          "    str     r3, [r1], #4\n"
          "    cmp     r1, r2\n"
          "    blt     copy_loop_itcm\n");

    //
    // Zero fill the bss segment.
    //
    __asm("    ldr     r0, =_sbss\n"
          "    ldr     r1, =_ebss\n"
          "    mov     r2, #0\n"
          "zero_loop:\n"
          "        cmp     r0, r1\n"
          "        it      lt\n"
          "        strlt   r2, [r0], #4\n"
          "        blt     zero_loop");

   //
   // Zero fill the shared‐SRAM BSS region.
   //
   __asm("    ldr     r0, =_ssram_bss\n"
         "    ldr     r1, =_esram_bss\n"
         "    mov     r2, #0\n"
         "zero_sram_loop:\n"
         "        cmp     r0, r1\n"
         "        it      lt\n"
         "        strlt   r2, [r0], #4\n"
         "        blt     zero_sram_loop\n");   

    //
    // CMSIS System Initialization
    //
    SystemInit();

    __libc_init_array();

    //
    // Call the application's entry point.
    //
    main();

    //
    // If main returns then execute a break point instruction
    //
    __asm("    bkpt     ");
}
#else
#error GNU STDC inline not supported.
#endif

//*****************************************************************************
//
// This is the code that gets called when the processor receives a NMI.  This
// simply enters an infinite loop, preserving the system state for examination
// by a debugger.
//
//*****************************************************************************
void
NMI_Handler(void)
{
    //
    // Go into an infinite loop.
    //
    while(1)
    {
    }
}

//*****************************************************************************
//
// This is the code that gets called when the processor receives a fault
// interrupt.  This simply enters an infinite loop, preserving the system state
// for examination by a debugger.
//
//*****************************************************************************
// void
// HardFault_Handler(void)
// {
//     //
//     // Go into an infinite loop.
//     //
//     while(1)
//     {
//     }
// }

// Pull in CMSIS core defs (SCB, register names)
#include "core_cm55.h"   // or simply "cmsis.h" depending on your tree
#include "ns_ambiqsuite_harness.h"
#include <stdbool.h>

// ---- CONFIG ----
// Heuristic code range for "is this a code address?" check.
// Adjust to your SoC memory map (Flash, XIP, ITCM, etc.)
#ifndef CODE_START
#define CODE_START   (0x00410000UL)
#endif
#ifndef CODE_END
#define CODE_END     (0x00800000UL)  
#endif

// How many 32-bit words of stack to scan for potential return addresses
#ifndef BT_SCAN_WORDS
#define BT_SCAN_WORDS  256
#endif

// Maximum number of backtrace entries to print
#ifndef BT_MAX_FRAMES
#define BT_MAX_FRAMES  16
#endif

// Weak linker symbols for stack bounds (typical CMSIS names).
// Provide these in your linker script; we fall back gracefully if missing.
__attribute__((weak)) extern uint32_t __StackTop;
__attribute__((weak)) extern uint32_t __StackLimit;

// Structure of the basic (non-FP) stacked frame pushed on exception entry.
typedef struct {
    uint32_t r0;
    uint32_t r1;
    uint32_t r2;
    uint32_t r3;
    uint32_t r12;
    uint32_t lr;   // return address into the interrupted code
    uint32_t pc;   // program counter at the time of fault
    uint32_t xpsr;
} stacked_regs_t;

static inline const char *which_stack(uint32_t exc_return) {
    // EXC_RETURN bit[2]: 0=MSP, 1=PSP
    return (exc_return & (1UL << 2)) ? "PSP" : "MSP";
}

static inline bool exc_frame_has_fp(uint32_t exc_return) {
    // EXC_RETURN bit[4]: 0 = FP context stacked, 1 = no FP context
    return ((exc_return & (1UL << 4)) == 0U);
}

