AmbiqAI/neuralSPOT/neuralspot/ns-core/src/apollo510b/gcc/startup_gcc.c
static inline bool is_thumb_code(uint32_t addr) {
    // On Cortex-M, code addresses are Thumb; return addresses typically have bit0=1.
    return (addr & 0x1U) != 0;
}

static inline bool is_code_addr(uint32_t addr) {
    return (addr >= CODE_START) && (addr < CODE_END) && is_thumb_code(addr);
}

static void print_cfsr_details(uint32_t cfsr) {
    uint32_t mmfsr =  cfsr        & 0xFFU;       // MemManage Faults
    uint32_t bfsr  = (cfsr >> 8)  & 0xFFU;       // Bus Faults
    uint32_t ufsr  = (cfsr >> 16) & 0xFFFFU;     // Usage Faults

    if (mmfsr) {
        ns_lp_printf("  MMFSR: 0x%02lx", (unsigned long)mmfsr);
        if (mmfsr & (1U << 0)) ns_lp_printf("  [IACCVIOL]");
        if (mmfsr & (1U << 1)) ns_lp_printf("  [DACCVIOL]");
        if (mmfsr & (1U << 3)) ns_lp_printf("  [MUNSTKERR]");
        if (mmfsr & (1U << 4)) ns_lp_printf("  [MSTKERR]");
        if (mmfsr & (1U << 5)) ns_lp_printf("  [MLSPERR]");
        if (mmfsr & (1U << 7)) ns_lp_printf("  [MMARVALID]");
        ns_lp_printf("\r\n");
    }

    if (bfsr) {
        ns_lp_printf("  BFSR:  0x%02lx", (unsigned long)bfsr);
        if (bfsr & (1U << 0)) ns_lp_printf("  [IBUSERR]");
        if (bfsr & (1U << 1)) ns_lp_printf("  [PRECISERR]");
        if (bfsr & (1U << 2)) ns_lp_printf("  [IMPRECISERR]");
        if (bfsr & (1U << 3)) ns_lp_printf("  [UNSTKERR]");
        if (bfsr & (1U << 4)) ns_lp_printf("  [STKERR]");
        if (bfsr & (1U << 5)) ns_lp_printf("  [LSPERR]");
        if (bfsr & (1U << 7)) ns_lp_printf("  [BFARVALID]");
        ns_lp_printf("\r\n");
    }

    if (ufsr) {
        ns_lp_printf("  UFSR:  0x%04lx", (unsigned long)ufsr);
        if (ufsr & (1U << 0))  ns_lp_printf("  [UNDEFINSTR]");
        if (ufsr & (1U << 1))  ns_lp_printf("  [INVSTATE]");
        if (ufsr & (1U << 2))  ns_lp_printf("  [INVPC]");
        if (ufsr & (1U << 3))  ns_lp_printf("  [NOCP]");
        if (ufsr & (1U << 8))  ns_lp_printf("  [UNALIGNED]");
        if (ufsr & (1U << 9))  ns_lp_printf("  [DIVBYZERO]");
        ns_lp_printf("\r\n");
    }
}

// --- Armclang/Keil stack symbols (scatter file) ---------------------------
// We alias the linker symbol names (with $$ in them) to C identifiers.
__attribute__((weak)) extern const uint32_t __arm_stack_base  __asm("Image$$ARM_LIB_STACK$$Base");
__attribute__((weak)) extern const uint32_t __arm_stack_limit __asm("Image$$ARM_LIB_STACK$$Limit");
// Some projects emit ZI variants; declare them too (weak), harmless if absent.
__attribute__((weak)) extern const uint32_t __arm_stack_zi_base  __asm("Image$$ARM_LIB_STACK$$ZI$$Base");
__attribute__((weak)) extern const uint32_t __arm_stack_zi_limit __asm("Image$$ARM_LIB_STACK$$ZI$$Limit");

// Optional Keil startup symbol for the initial MSP (top of main stack)
__attribute__((weak)) extern const uint32_t __initial_sp;

// If you want a hard-coded emergency fallback for your exact .sct (from your post):
// ARM_LIB_STACK 0x20080000 EMPTY - 0x00003000
#ifndef MANUAL_MAIN_STACK_TOP
#define MANUAL_MAIN_STACK_TOP   ((uint32_t *)0x20080000UL)
#define MANUAL_MAIN_STACK_LIMIT ((uint32_t *)(0x20080000UL - 0x00003000UL))
#endif

// Helper: resolve main stack (MSP) bounds for Armclang/Keil.
static void resolve_main_stack_bounds(uint32_t **out_limit, uint32_t **out_top) {
    uint32_t *limit = 0, *top = 0;

    // Prefer non-ZI armclang symbols
    if (&__arm_stack_base)  limit = (uint32_t *)&__arm_stack_base;   // lower address
    if (&__arm_stack_limit) top   = (uint32_t *)&__arm_stack_limit;  // higher address (initial SP)

    // Try ZI variants if needed
    if ((!limit || !top) && &__arm_stack_zi_base)
        limit = (uint32_t *)&__arm_stack_zi_base;
    if ((!limit || !top) && &__arm_stack_zi_limit)
        top   = (uint32_t *)&__arm_stack_zi_limit;

    // Try Keil startup symbol
    if (!top && &__initial_sp) {
        top = (uint32_t *)&__initial_sp;
    }

    // As a robust fallback, read the initial MSP from the vector table (word 0 at VTOR)
    if (!top) {
        uint32_t vtor = SCB->VTOR ? SCB->VTOR : 0x00000000UL;
        top = (uint32_t *)(*(uint32_t *)vtor);
    }

    // If we *still* don’t have a limit, use the manual constants (from your .sct)
    if (!limit) {
        limit = MANUAL_MAIN_STACK_LIMIT;
    }
    if (!top) {
        top = MANUAL_MAIN_STACK_TOP;
    }

    *out_limit = limit;
    *out_top   = top;
}

// Replace your old dump_callstack() with this safer version.
// It will scan up to BT_SCAN_WORDS but never past stack_top if known.
// If bounds are unknown (e.g., PSP under an RTOS), it still scans a small window.
static void dump_callstack(uint32_t *sp, uint32_t *stack_limit, uint32_t *stack_top) {
    uint32_t *start = sp;
    uint32_t *end;

    if (stack_top && (sp < stack_top)) {
        // Clamp to the top of the (down-growing) stack region
        uint32_t max_words = (uint32_t)(stack_top - sp);
        if (max_words > BT_SCAN_WORDS) max_words = BT_SCAN_WORDS;
        end = sp + max_words;
    } else {
        // Bounds unknown: do a short, conservative scan forward
        end = sp + BT_SCAN_WORDS;
    }

    if (!stack_limit || !stack_top) {
        ns_lp_printf("Call stack: bounds unknown; scanning %u words\r\n", (unsigned)(end - start));
    } else if (sp < stack_limit || sp >= stack_top) {
        ns_lp_printf("Call stack: SP (0x%08lx) outside [0x%08lx..0x%08lx), scanning %u words anyway\r\n",
                     (unsigned long)(uintptr_t)sp,
                     (unsigned long)(uintptr_t)stack_limit,
                     (unsigned long)(uintptr_t)stack_top,
                     (unsigned)(end - start));
    } else {
        ns_lp_printf("Call stack (scan %u words within stack bounds):\r\n", (unsigned)(end - start));
    }

    int found = 0;
    for (uint32_t *p = start; p < end && found < BT_MAX_FRAMES; ++p) {
        uint32_t addr = *p;
        if (is_code_addr(addr)) {
            ns_lp_printf("  #%02d: 0x%08lx\r\n", found, (unsigned long)addr);
            found++;
        }
    }
    if (found == 0) {
        ns_lp_printf("  (no plausible return addresses found)\r\n");
    }
}

// C side of the handler. 'sp' is the base of the stacked frame (FP part removed if present).
void hardfault_handler_c(uint32_t *sp, uint32_t exc_return) {
    // If FP context was stacked, the basic regs are after 16 S regs + FPSCR + reserved = 18 words
    if (exc_frame_has_fp(exc_return)) {
        sp += 18U;
    }

    stacked_regs_t *frame = (stacked_regs_t *)sp;

    // Read SCB fault diagnostics
    uint32_t hfsr  = SCB->HFSR;
    uint32_t cfsr  = SCB->CFSR;
    uint32_t bfar  = SCB->BFAR;
    uint32_t mmfar = SCB->MMFAR;
    uint32_t shcsr = SCB->SHCSR;
    uint32_t afsr  = SCB->AFSR;

