AmbiqAI/neuralSPOT/neuralspot/ns-core/src/apollo510b/gcc/startup_gcc.c
    // Some extra context (optional). Use CMSIS intrinsics with armclang.
    // These compile on GCC/Clang/Arm Compiler 6.
    uint32_t control   = __get_CONTROL();
    uint32_t primask   = __get_PRIMASK();
    uint32_t basepri   = __get_BASEPRI();
    uint32_t faultmask = __get_FAULTMASK();

    ns_lp_printf("\r\n========== HARD FAULT ==========\r\n");
    ns_lp_printf("EXC_RETURN:  0x%08lx  (%s, %s frame)\r\n",
                 (unsigned long)exc_return,
                 which_stack(exc_return),
                 exc_frame_has_fp(exc_return) ? "with FP" : "no FP");

    ns_lp_printf("Stacked registers:\r\n");
    ns_lp_printf("  R0  = 0x%08lx  R1  = 0x%08lx  R2  = 0x%08lx  R3  = 0x%08lx\r\n",
                 (unsigned long)frame->r0, (unsigned long)frame->r1,
                 (unsigned long)frame->r2, (unsigned long)frame->r3);
    ns_lp_printf("  R12 = 0x%08lx  LR  = 0x%08lx  PC  = 0x%08lx  xPSR= 0x%08lx\r\n",
                 (unsigned long)frame->r12, (unsigned long)frame->lr,
                 (unsigned long)frame->pc,  (unsigned long)frame->xpsr);

    ns_lp_printf("SCB: HFSR=0x%08lx  CFSR=0x%08lx  SHCSR=0x%08lx  AFSR=0x%08lx\r\n",
                 (unsigned long)hfsr, (unsigned long)cfsr,
                 (unsigned long)shcsr, (unsigned long)afsr);

    // Decode key HFSR bits
    if (hfsr) {
        ns_lp_printf("  HFSR bits:");
        if (hfsr & (1UL << 1))  ns_lp_printf(" [VECTTBL]");   // Bus fault on vector table read
        if (hfsr & (1UL << 30)) ns_lp_printf(" [FORCED]");     // Escalated fault
        if (hfsr & (1UL << 31)) ns_lp_printf(" [DEBUGEVT]");   // Debug event
        ns_lp_printf("\r\n");
    }

    // Decode CFSR breakdown
    if (cfsr) {
        print_cfsr_details(cfsr);
    }

    // BFAR/MMFAR valid bits
    if (cfsr & (1U << 15)) {
        ns_lp_printf("  BFAR (valid)  = 0x%08lx\r\n", (unsigned long)bfar);
    }
    if (cfsr & (1U << 7)) {
        ns_lp_printf("  MMFAR (valid) = 0x%08lx\r\n", (unsigned long)mmfar);
    }

    ns_lp_printf("CONTROL=0x%08lx  PRIMASK=0x%08lx  BASEPRI=0x%08lx  FAULTMASK=0x%08lx\r\n",
                 (unsigned long)control, (unsigned long)primask,
                 (unsigned long)basepri, (unsigned long)faultmask);

    // Stack bounds from linker, if available
    uint32_t *stack_top   = 0;
    uint32_t *stack_limit = 0;

    // Resolve **main stack (MSP)** bounds from scatter file / VTOR
    resolve_main_stack_bounds(&stack_limit, &stack_top);

    // If faulted context used PSP (EXC_RETURN bit2==1), we likely *don’t* know PSP bounds
    // unless you integrate with your RTOS to query the current thread’s stack.
    // We keep stack_limit/top for logging, but the scanner will safely limit itself.
    const bool used_psp = (exc_return & (1UL << 2)) != 0;

    ns_lp_printf("Active %s @ SP=0x%08lx  MainStackLimit=0x%08lx  MainStackTop=0x%08lx\r\n",
                 used_psp ? "PSP" : "MSP",
                 (unsigned long)(uintptr_t)sp,
                 (unsigned long)(uintptr_t)stack_limit,
                 (unsigned long)(uintptr_t)stack_top);

    dump_callstack(sp, used_psp ? 0 : stack_limit, used_psp ? 0 : stack_top);

    ns_lp_printf("========== END HARD FAULT ========\r\n");

    // Optional: loop here, or trigger system reset
    // NVIC_SystemReset();
    while (1) { __WFI(); }
}

// Naked wrapper to capture the right SP (MSP/PSP) and EXC_RETURN (LR)
__attribute__((naked)) void HardFault_Handler(void) {
    __asm volatile(
        "tst   lr, #4          \n" // Test EXC_RETURN bit 2: 0=MSP, 1=PSP
        "ite   eq              \n"
        "mrseq r0, msp         \n"
        "mrsne r0, psp         \n"
        "mov   r1, lr          \n" // r1 = EXC_RETURN
        "b     hardfault_handler_c \n"
    );
}
//*****************************************************************************
//
// This is the code that gets called when the processor receives an unexpected
// interrupt.  This simply enters an infinite loop, preserving the system state
// for examination by a debugger.
//
//*****************************************************************************
void
am_default_isr(void)
{
    //
    // Go into an infinite loop.
    //
    while(1)
    {
    }
}

